[
  {
    "id": 4,
    "slug": "mama-hogbe-2024-winner-announcement",
    "title": "Mama Hogbe 2024 Crowns Andrea Sandra Delali Gakpe as Queen",
    "date": "July 10, 2025",
    "category": "Press Release",
    "readTime": "5 min read",
    "image": "/blog/mama-hogbe-winner-2024.jpg",
    "excerpt": "The Anlo State has crowned Andrea Sandra Delali Gakpe as the new Mama Hogbe 2024. In a night of elegance, culture, and advocacy, the top three finalists were announced at the grand finale held in Keta.",
    "content": [
      {
        "type": "paragraph",
        "text": "In a dazzling night celebrating the richness of Ewe tradition and female empowerment, Mama Hogbe 2024 has officially crowned Andrea Sandra Delali Gakpe as the Queen. The grand finale, hosted at the Keta Municipal Auditorium on December 25, united cultural icons, dignitaries, and supporters from across the Volta Region and beyond."
      },
      {
        "type": "heading",
        "text": "The New Queen: Andrea Sandra Delali Gakpe"
      },
      {
        "type": "paragraph",
        "text": "Andrea, a 23-year-old teacher and poet from Anloga-Deti, wowed judges with her passionate advocacy for youth education and cultural literacy. Her stage performance combined traditional storytelling with spoken word, igniting applause and admiration from the crowd. As Queen, she receives the prestigious crown, ambassadorial duties, and a grand prize including exclusive items and a GHS 10,000 cash award."
      },
      {
        "type": "heading",
        "text": "Other Titleholders"
      },
      {
        "type": "bullets",
        "items": [
          "🥈 1st Runner-up: Sedem Rita Amematror, 22 — a creative fashion designer from Horvi-Blekusu.",
          "🥉 2nd Runner-up: Stella Sewonumafe Sodzi, 25 — a dedicated caterer from Kome-Atito."
        ]
      },
      {
        "type": "heading",
        "text": "Celebrating Culture, Strength & Legacy"
      },
      {
        "type": "paragraph",
        "text": "Mama Hogbe is more than a beauty pageant — it's a revival of Anlo heritage, womanhood, and purpose. This year’s theme emphasized service, cultural literacy, and innovation in leadership. Through workshops, mentorships, and stage challenges, contestants demonstrated intellect, creativity, and community commitment."
      },
      {
        "type": "paragraph",
        "text": "The event also featured musical performances, poetry readings, and a symbolic torch-lighting ceremony honoring past queens. It stood as a reminder that Anlo tradition continues to evolve while rooted in deep values."
      },
      {
        "type": "heading",
        "text": "Organizers & Sponsors"
      },
      {
        "type": "paragraph",
        "text": "Mama Hogbe 2024 was made possible through the collaboration of Xtopay LLC, Channel 7 Networks, Volta Education Trust, and many more. The organizers extend gratitude to media partners such as Xcite TV, Keta Vibes, and Clickers, along with supporting bodies from Volta Health, Sports, Agriculture, and Culture networks."
      },
      {
        "type": "heading",
        "text": "Quote from the Queen"
      },
      {
        "type": "quote",
        "author": "Andrea Sandra Delali Gakpe",
        "text": "Mama Hogbe is more than a pageant; it is a voice, a vision, and a vow. I am honored to carry the crown and represent every young girl with a dream and a story worth telling."
      },
      {
        "type": "heading",
        "text": "What’s Next"
      },
      {
        "type": "paragraph",
        "text": "As Queen, Andrea will embark on a year-long tour across the Volta Region, championing education, creative arts, and civic empowerment. Her outreach program includes school visits, cultural exchanges, and mentorship sessions for young girls. Stay updated through our official channels for upcoming appearances, workshops, and interviews."
      }
    ],
    "author": {
      "name": "Mama Hogbe Secretariat",
      "role": "Communications Director",
      "image": "/images/team/mh-secretariat.jpg"
    },
    "relatedPosts": [
      1,
      1
    ]
  }
]